
## Plan Result (terraform)

[CI link](https://github.com/naari3/bakatare-minna/actions/runs/7357411041)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * google_compute_instance_group_manager.minecraft_group
* Replace
  * google_compute_instance_template.minecraft_template


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_compute_instance_group_manager.minecraft_group will be updated in-place
  ~ resource "google_compute_instance_group_manager" "minecraft_group" {
        id                             = "projects/bakatare-minecraft/zones/us-central1-a/instanceGroupManagers/minecraft-group"
        name                           = "minecraft-group"
        # (12 unchanged attributes hidden)

      ~ version {
          ~ instance_template = "https://www.googleapis.com/compute/v1/projects/bakatare-minecraft/global/instanceTemplates/minecraft-template-20231229133628741600000001" -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # google_compute_instance_template.minecraft_template must be replaced
-/+ resource "google_compute_instance_template" "minecraft_template" {
      ~ effective_labels        = {} -> (known after apply)
      ~ id                      = "projects/bakatare-minecraft/global/instanceTemplates/minecraft-template-20231229133628741600000001" -> (known after apply)
      ~ metadata_fingerprint    = "uqqDdRDrjRU=" -> (known after apply)
      ~ metadata_startup_script = <<-EOT # forces replacement
          - INSTANCE_NAME=$(curl "http://metadata.google.internal/computeMetadata/v1/instance/name" -H "Metadata-Flavor: Google")
          + INSTANCE_NAME=$(curl "http://metadata.google.internal/computeMetadata/v1/instance/name" -H "Metadata-Flavor: Google" | tr -d '\n')
            
            # 新しいディスクを確認し、存在する場合はフォーマットしてマウントする!!!
            FS_TYPE="ext4"
            DISK="/dev/disk/by-id/google-minecraft"
            MOUNT_POINT="/mnt/stateful_partition/minecraft"
            
            gcloud compute instances attach-disk $$INSTANCE_NAME \
              --disk projects/bakatare-minecraft/zones/us-central1-a/disks/world-data \
              --zone us-central1-a \
              --device-name minecraft \
              --mode rw
            
            # デバイスが現れるまで待つ
            while [ ! -e $DISK ]; do
              echo "Waiting for $DEVICE to be attached"
              sleep 1
            done
            
            # マウントポイントを作成
            mkdir -p "${MOUNT_POINT}"
            
            # ディスクがフォーマットされているか確認
            if ! blkid "${DISK}" > /dev/null 2>&1; then
                echo "Formatting disk ${DISK}"
                # ディスクをフォーマット
                mkfs.ext4 -F "${DISK}"
            fi
            
            # ディスクをマウント
            echo "Mounting disk ${DISK} at ${MOUNT_POINT}"
            mount -t "${FS_TYPE}" "${DISK}" "${MOUNT_POINT}"
            
            # 自動マウントの設定
            if ! grep -qs "${MOUNT_POINT} " /etc/fstab; then
                echo "Adding ${MOUNT_POINT} to /etc/fstab"
                echo "${DISK} ${MOUNT_POINT} ${FS_TYPE} defaults 0 2" >> /etc/fstab
            fi
            
            apt-get update -y
            apt-get install -y apt-transport-https ca-certificates curl software-properties-common
            curl -fsSL https://download.docker.com/linux/ubuntu/gpg | sudo apt-key add -
            add-apt-repository "deb [arch=arm64] https://download.docker.com/linux/ubuntu focal stable"
            apt-get install -y docker-ce
            apt-get install docker-compose-plugin
            systemctl start docker
            systemctl enable docker
            
            git clone https://github.com/naari3/bakatare-minna ~/bakatare-minna
            cd ~/bakatare-minna/docker
            docker compose up -d
        EOT
      ~ name                    = "minecraft-template-20231229133628741600000001" -> (known after apply)
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/bakatare-minecraft/global/instanceTemplates/minecraft-template-20231229133628741600000001" -> (known after apply)
      ~ self_link_unique        = "https://www.googleapis.com/compute/v1/projects/bakatare-minecraft/global/instanceTemplates/minecraft-template-20231229133628741600000001?uniqueId=2187709331286488498" -> (known after apply)
        tags                    = [
            "minecraft",
        ]
      + tags_fingerprint        = (known after apply)
      ~ terraform_labels        = {} -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ disk {
          ~ device_name       = "persistent-disk-0" -> (known after apply)
          ~ interface         = "SCSI" -> (known after apply)
          - labels            = {} -> null
          ~ mode              = "READ_WRITE" -> (known after apply)
          ~ provisioned_iops  = 0 -> (known after apply)
          - resource_policies = [] -> null
          ~ type              = "PERSISTENT" -> (known after apply)
            # (5 unchanged attributes hidden)
        }

      ~ network_interface {
          ~ internal_ipv6_prefix_length = 0 -> (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          ~ name                        = "nic0" -> (known after apply)
          ~ network                     = "https://www.googleapis.com/compute/v1/projects/bakatare-minecraft/global/networks/minecraft" -> "minecraft"
          - queue_count                 = 0 -> null
          + stack_type                  = (known after apply)
          + subnetwork                  = (known after apply)
          + subnetwork_project          = (known after apply)

          ~ access_config {
              ~ network_tier           = "PREMIUM" -> (known after apply)
              + public_ptr_domain_name = (known after apply)
                # (1 unchanged attribute hidden)
            }
        }

      ~ scheduling {
          - min_node_cpus       = 0 -> null
          ~ on_host_maintenance = "TERMINATE" -> (known after apply)
          + provisioning_model  = (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":48,"Program":"tfcmt","SHA1":"d08295fca0109dafe1a7cf270dc984a8c8acf8d6","Target":"terraform","Vars":{},"WorkflowName":"test"} -->